{/* eslint-disable react/no-unescaped-entities */}
export default function General(){
    return (
        <div className="max-w-[1320px] mx-auto w-full px-4 sm:px-6 lg:px-8 py-10">
      <h1 className="text-blue-accent font-title font-bold text-[32px] sm:text-[40px] lg:text-[48px] uppercase mb-8">
        Історія, місія, візія
      </h1>

      <div className="flex flex-col gap-10 text-[16px] sm:text-[18px] text-[#171717] font-body leading-relaxed">
        <p>
          Вагомі багаторічні напрацювання компанії «IT STEP» з провадження неформальної та інституційної
          освіти в сфері інформаційних технологій, досвід підготовки фахівців-айтішників «Одеським
          технологічним університетом «ШАГ»» дали можливість вибудувати ступеневий цикл підготовки
          спеціалістів для IT-індустрії. Наявні в університеті кадрові, матеріально-технічні,
          навчально-методичні ресурси, потреби ринку праці IT галузі дозволили започаткувати у 2023 році
          підготовку фахових молодших бакалаврів за спеціальністю 122 «Комп'ютерні науки» на базі
          новоутвореного відокремленого підрозділу університету «Фаховий коледж «IT STEP»».
        </p>

        <p>
          Рішення засновників університету про створення коледжу від 18 січня 2023р.
        </p>

        <p>
          Ліцензія: Наказ МОН України №182-Л, від 24.05.2023.
        </p>

        <p>
          Переоформлення ліцензії: Наказ №42-л від 22.04.2025
        </p>
      </div>
    </div>
    )
}